tap "al-the-x/mine"
tap "anyenv/anyenv"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
tap "nodenv/nodenv"
# Search tool like grep, but optimized for programmers
brew "ack"
# Record and share terminal sessions
brew "asciinema"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Reimplementation of ctags(1)
brew "ctags"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Run arbitrary commands when files change
brew "entr"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils", args: ["with-default-names"]
# Infocom-style interactive fiction player
brew "frotz"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Command-line option parsing utility
brew "gnu-getopt"
# AVH edition of git-flow
brew "git-flow-avh"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Generic library support script
brew "libtool"
# Asynchronous event library
brew "libevent"
# Apply a diff file to an original
brew "gpatch"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Git dotfiles synchronizer written in bash
brew "homeshick"
# Instant coding answers via the command-line
brew "howdoi"
# Add GitHub support to git on the command-line
brew "hub"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Pager program similar to more
brew "less"
# Python generator for the console
brew "lorem"
# Text-to-HTML conversion tool
brew "markdown"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple NodeJS versions
brew "nodenv"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Makes shims aware of bundle install paths
brew "rbenv-bundler"
# Resolves abbreviations and aliases to Ruby versions
brew "rbenv-whatis"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "al-the-x/mine/shiny-and-gnu", args: ["HEAD"]
cask "amethyst"
cask "balenaetcher"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "iterm2"
cask "rescuetime"
cask "signal"
cask "slack"
cask "vagrant"
