tap "al-the-x/mine"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/games"
tap "homebrew/versions"
tap "neovim/neovim"
brew "ack"
brew "autoconf"
brew "automake"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "dateutils"
brew "diffutils"
brew "direnv"
brew "dos2unix"
brew "git"
brew "drafter", args: ["HEAD"]
brew "findutils", args: ["with-default-names"]
brew "frotz"
brew "gawk"
brew "gdbm"
brew "gettext"
brew "gist"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "gnu-which", args: ["with-default-names"]
brew "gnupg"
brew "gpatch"
brew "pcre"
brew "grep", args: ["with-default-names"]
brew "gzip"
brew "hub"
brew "oniguruma"
brew "jq"
brew "less"
brew "openssl"
brew "libevent"
brew "libtool"
brew "libyaml"
brew "lorem"
brew "markdown"
brew "moreutils"
brew "neovim"
brew "node"
brew "nvm"
brew "openssh"
brew "pstree"
brew "sqlite"
brew "python"
brew "python3"
brew "reattach-to-user-namespace"
brew "rlwrap"
brew "rsync"
brew "ruby"
brew "ruby-install"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "unzip"
brew "watch"
brew "wdiff", args: ["with-gettext"]
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "google-chrome"
cask "iterm2"
cask "lighttable"
cask "skyfonts"
